Tekla Open API Reference for Tekla Structures 2025
CrossSection.Select Method (Double, Double)
 Selects the cross section from the profile definition.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	double Location = 0,
	double Length = 1000
)
Public Function Select (
	Optional Location As Double = 0,
	Optional Length As Double = 1000
) As Boolean
Parameters
Location (Optional)
Type: System.Double
The location from where cross section is fetched.
Length (Optional)
Type: System.Double
The total length of the profile.
Return Value
Type: Boolean
True in success.
See Also
Reference
CrossSection Class
Select Overload
Tekla.Structures.Catalogs Namespace